
#05: Membalik urutan baris dan kolom pada Data Frame


Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

Persiapan Data Frame

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  4  6  4  7  8
1  3  1  9  3  3
2  9  3  3  8  3
3  8  2  8  7  4
4  2  1  1  4  6

Membalik urutan kolom

In [3]:

df.loc[:, ::-1]

   E  D  C  B  A
0  8  7  4  6  4
1  3  3  9  1  3
2  3  8  3  3  9
3  4  7  8  2  8
4  6  4  1  1  2

Membalik urutan baris

In [4]:

df.loc[::-1]

   A  B  C  D  E
4  2  1  1  4  6
3  8  2  8  7  4
2  9  3  3  8  3
1  3  1  9  3  3
0  4  6  4  7  8

Membalik urutan baris dan melakukan penyesuaian ulang index

In [5]:
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  2  1  1  4  6
1  8  2  8  7  4
2  9  3  3  8  3
3  3  1  9  3  3
4  4  6  4  7  8

#06: Mengganti nama (label) kolom pada Data Frame

Mengganti nama (label) untuk sebuah kolom pada Data Frame

In [6]:
df.rename(columns={'C':'Hobi'})

   A  B  Hobi  D  E
0  4  6     4  7  8
1  3  1     9  3  3
2  9  3     3  8  3
3  8  2     8  7  4
4  2  1     1  4  6

Mengganti nama (label) untuk banyak kolom pada Data Frame

In [7]:
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     4       6  4     7  8
1     3       1  9     3  3
2     9       3  3     8  3
3     8       2  8     7  4
4     2       1  1     4  6